""" Отборочное задание на школу Intel N3 """

# Написать код, вывести результат работы простого арифметического алгоритма с экрана

A = 120
B = 100
A = A + B/2
if B < A/2:
    C = B + A
else:
    C = B + A/2
print(C)
